tutorials/multiphase/interFoam/RAS/DTCHull/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# copy DTC hull surface from resources folder
\cp $FOAM_TUTORIALS/resources/geometry/DTC-scaled.stl.gz constant/triSurface/

runApplication surfaceFeatureExtract
runApplication blockMesh

for i in 1 2 3 4 5 6
do
    runApplication -s $i \
        topoSet -dict system/topoSetDict.${i}

    runApplication -s $i \
        refineMesh -dict system/refineMeshDict -overwrite
done

runApplication snappyHexMesh -overwrite
restore0Dir
runApplication setFields
runApplication decomposePar
runParallel renumberMesh -overwrite
runParallel $(getApplication)
runApplication reconstructPar

#------------------------------------------------------------------------------
